import Prelude hiding (map)

doubleForLoop = 
    [1, 2] >>= \dice1 -> 
    [10, 20] >>= \dice2 -> 
    [dice1 + dice2]

doubleForLoopDo = do
    f <- [1, 2]
    s <- [10, 20]
    [f + s]

-- >>= :: [a] -> (a -> [b]) -> b
-- xs >>= f = concat $ map f xs

-- [1, 2] >>= \dice1 -> [10, 20] >>= \dice2 -> [dice1 + dice2]

-- concat $ map (\dice1 -> [10, 20] >>= \dice2 -> [dice1 + dice2]) [1, 2]

-- concat $ map (\dice1 -> concat $ map (\dice2 -> [dice1 + dice2]) [10, 20]) [1, 2]

-- FLOW

{-
                                                 /---> (для dice2 = 10) ---> [11] ---\
                                                |                                    |
          /---> (для dice1 = 1) ---> [10, 20] --|                                    | ---> [[11], [21]] ---> [11, 21] ---\
         |                                      |                                    |                                     |
         |                                       \---> (для dice2 = 20) ---> [21] ---/                                     |
[1, 2] --|                                                                                                                 |---> [[11, 21], [12, 22]] -> [11, 21, 12, 22]            
         |                                       /---> (для dice2 = 10) ---> [12] ---\                                     |
         |                                      |                                     |                                    |
          \---> (для dice1 = 2) ---> [10, 20] --|                                     |---> [[12], [22]] ---> [12, 22] ---/
                                                |                                     |
                                                 \---> (для dice2 = 20) ---> [22] ---/

-}